In [2]:
import pandas as pd

In [3]:
#dataFrame a partir de un diccionario 
data = {
'nombre' : ['Juan','Pedro'],
'edad' : [20,34]
}
df = pd.DataFrame(data)
df

  nombre  edad
0   Juan    20
1  Pedro    34

In [4]:
#Leer archivos
df = pd.read_csv("./data/data.csv")
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [5]:
df = pd.read_csv("./data/data",sep='|')
df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [6]:
df = pd.read_csv("./data/data_without_header", header=None,names=['Nombresss','edad','ciudad'])
df

  Nombresss  edad     ciudad
0      Juan    25     Madrid
1     María    30  Barcelona
2     Pedro    35    Sevilla

In [7]:
df = pd.read_json("./data/data.json")
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [8]:
df.head(1)

  nombre  edad  ciudad
0   Juan    25  Madrid

In [9]:
df.head()

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [10]:
df.columns

Index(['nombre', 'edad', 'ciudad'], dtype='object')

In [11]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [12]:
df.describe()

       edad
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [13]:
df.tail(1)

  nombre  edad   ciudad
2  Pedro    35  Sevilla

In [14]:
df['ciudad']

0       Madrid
1    Barcelona
2      Sevilla
Name: ciudad, dtype: object

In [15]:
df[['ciudad','edad']]

      ciudad  edad
0     Madrid    25
1  Barcelona    30
2    Sevilla    35

In [16]:
df.loc[0]

nombre      Juan
edad          25
ciudad    Madrid
Name: 0, dtype: object

In [17]:
df.loc[[0,1]]

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona

In [18]:
df[df['edad']>25]

  nombre  edad     ciudad
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [19]:
data = {
    'grupo': ['A','B','A','B'],
    'valor': [10,20,30,15]
}
df = pd.DataFrame(data)
df

  grupo  valor
0     A     10
1     B     20
2     A     30
3     B     15

In [20]:
df.groupby('grupo').mean()

       valor
grupo
A       20.0
B       17.5

In [21]:
df.groupby('grupo').sum()

       valor
grupo
A         40
B         35

In [22]:
dict1 = {
    'A': ['A0','A1','A2'],
    'clave1': ['K0','K1','K2']
}
df1 = pd.DataFrame(dict1)

dict2 = {
    'B' : ['B0','B1'],
    'clave2' : ['K0','k2']
}
df2 = pd.DataFrame(dict2)

df1

    A clave1
0  A0     K0
1  A1     K1
2  A2     K2

In [23]:
df2

    B clave2
0  B0     K0
1  B1     k2

In [24]:
pd.merge(df1,df2, on='clave')

KeyError: 'clave'

In [25]:
#merge con clave diferente 
pd.merge(df1, df2, left_on='clave1',right_on='clave2')

    A clave1   B clave2
0  A0     K0  B0     K0

In [26]:
df

  grupo  valor
0     A     10
1     B     20
2     A     30
3     B     15

In [27]:
df['doble_valor'] = df['valor'].apply(lambda x: x*2)
df

  grupo  valor  doble_valor
0     A     10           20
1     B     20           40
2     A     30           60
3     B     15           30

In [28]:
df['suma'] = df.apply(lambda row: row['valor'] + row['doble_valor'], axis=1)
df

  grupo  valor  doble_valor  suma
0     A     10           20    30
1     B     20           40    60
2     A     30           60    90
3     B     15           30    45